colinporth/seggerF7/BSP/stm32746g_audio.c
  // Configure SAI Block_x Slot
  // Slot First Bit Offset: 0
  // Slot Size  : 16
  // Slot Number: 4
  // Slot Active: All slot actives
  haudio_out_sai.SlotInit.FirstBitOffset = 0;
  haudio_out_sai.SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
  haudio_out_sai.SlotInit.SlotNumber = 4;
  haudio_out_sai.SlotInit.SlotActive = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1 | SAI_SLOTACTIVE_2 | SAI_SLOTACTIVE_3;

  HAL_SAI_Init(&haudio_out_sai);

  // Enable SAI peripheral to generate MCLK */
  __HAL_SAI_ENABLE(&haudio_out_sai);
  }
//}}}
//{{{
static void SAIx_Out_DeInit() {

  // Initialize the haudio_out_sai Instance parameter
  haudio_out_sai.Instance = AUDIO_OUT_SAIx;

  // Disable SAI peripheral
  __HAL_SAI_DISABLE (&haudio_out_sai);
  HAL_SAI_DeInit (&haudio_out_sai);
  }
//}}}
//{{{
static void SAIx_In_Init (uint32_t SaiOutMode, uint32_t SlotActive, uint32_t AudioFreq) {

  // Initialize SAI2 block A in MASTER RX
  // Initialize the haudio_out_sai Instance parameter
  haudio_out_sai.Instance = AUDIO_OUT_SAIx;

  // Disable SAI peripheral to allow access to SAI internal registers
  __HAL_SAI_DISABLE(&haudio_out_sai);

  // Configure SAI_Block_x
  // LSBFirst: Disabled
  // DataSize: 16
  haudio_out_sai.Init.AudioFrequency = AudioFreq;
  haudio_out_sai.Init.AudioMode = SaiOutMode;
  haudio_out_sai.Init.NoDivider = SAI_MASTERDIVIDER_ENABLED;
  haudio_out_sai.Init.Protocol = SAI_FREE_PROTOCOL;
  haudio_out_sai.Init.DataSize = SAI_DATASIZE_16;
  haudio_out_sai.Init.FirstBit = SAI_FIRSTBIT_MSB;
  haudio_out_sai.Init.ClockStrobing = SAI_CLOCKSTROBING_RISINGEDGE;
  haudio_out_sai.Init.Synchro = SAI_ASYNCHRONOUS;
  haudio_out_sai.Init.OutputDrive = SAI_OUTPUTDRIVE_ENABLED;
  haudio_out_sai.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_1QF;

  // Configure SAI_Block_x Frame
  // Frame Length: 64
  // Frame active Length: 32
  // FS Definition: Start frame + Channel Side identification
  // FS Polarity: FS active Low
  // FS Offset: FS asserted one bit before the first bit of slot 0
  haudio_out_sai.FrameInit.FrameLength = 64;
  haudio_out_sai.FrameInit.ActiveFrameLength = 32;
  haudio_out_sai.FrameInit.FSDefinition = SAI_FS_CHANNEL_IDENTIFICATION;
  haudio_out_sai.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
  haudio_out_sai.FrameInit.FSOffset = SAI_FS_BEFOREFIRSTBIT;

  // Configure SAI Block_x Slot
  // Slot First Bit Offset: 0
  // Slot Size  : 16
  // Slot Number: 4
  // Slot Active: All slot actives
  haudio_out_sai.SlotInit.FirstBitOffset = 0;
  haudio_out_sai.SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
  haudio_out_sai.SlotInit.SlotNumber = 4;
  haudio_out_sai.SlotInit.SlotActive = SlotActive;

  HAL_SAI_Init(&haudio_out_sai);

  // Initialize SAI2 block B in SLAVE RX synchronous from SAI2 block A
  // Initialize the haudio_in_sai Instance parameter
  haudio_in_sai.Instance = AUDIO_IN_SAIx;

  // Disable SAI peripheral to allow access to SAI internal registers
  __HAL_SAI_DISABLE(&haudio_in_sai);

  // Configure SAI_Block_x LSBFirst: Disabled DataSize: 16
  haudio_in_sai.Init.AudioFrequency = AudioFreq;
  haudio_in_sai.Init.AudioMode = SAI_MODESLAVE_RX;
  haudio_in_sai.Init.NoDivider = SAI_MASTERDIVIDER_ENABLED;
  haudio_in_sai.Init.Protocol = SAI_FREE_PROTOCOL;
  haudio_in_sai.Init.DataSize = SAI_DATASIZE_16;
  haudio_in_sai.Init.FirstBit = SAI_FIRSTBIT_MSB;
  haudio_in_sai.Init.ClockStrobing = SAI_CLOCKSTROBING_RISINGEDGE;
  haudio_in_sai.Init.Synchro = SAI_SYNCHRONOUS;
  haudio_in_sai.Init.OutputDrive = SAI_OUTPUTDRIVE_DISABLED;
  haudio_in_sai.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_1QF;

  // Configure SAI_Block_x Frame
  // Frame Length: 64
  // Frame active Length: 32
  // FS Definition: Start frame + Channel Side identification
  // FS Polarity: FS active Low
  // FS Offset: FS asserted one bit before the first bit of slot 0
  haudio_in_sai.FrameInit.FrameLength = 64;
  haudio_in_sai.FrameInit.ActiveFrameLength = 32;
  haudio_in_sai.FrameInit.FSDefinition = SAI_FS_CHANNEL_IDENTIFICATION;
  haudio_in_sai.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
  haudio_in_sai.FrameInit.FSOffset = SAI_FS_BEFOREFIRSTBIT;

  // Configure SAI Block_x Slot
  // Slot First Bit Offset: 0
  // Slot Size  : 16
  // Slot Number: 4
  // Slot Active: All slot active
  haudio_in_sai.SlotInit.FirstBitOffset = 0;
  haudio_in_sai.SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
  haudio_in_sai.SlotInit.SlotNumber = 4;
  haudio_in_sai.SlotInit.SlotActive = SlotActive;

  HAL_SAI_Init(&haudio_in_sai);

  // Enable SAI peripheral to generate MCLK
  __HAL_SAI_ENABLE(&haudio_out_sai);

  // Enable SAI peripheral
  __HAL_SAI_ENABLE(&haudio_in_sai);
  }
//}}}
//{{{
static void SAIx_In_DeInit() {

  // Initialize the haudio_in_sai Instance parameter
  haudio_in_sai.Instance = AUDIO_IN_SAIx;

  // Disable SAI peripheral
  __HAL_SAI_DISABLE(&haudio_in_sai);
  HAL_SAI_DeInit(&haudio_in_sai);
  }
//}}}

//{{{
void HAL_SAI_TxCpltCallback (SAI_HandleTypeDef *hsai) {
  BSP_AUDIO_OUT_TransferComplete_CallBack();
  }
//}}}
//{{{
void HAL_SAI_TxHalfCpltCallback (SAI_HandleTypeDef *hsai) {
  BSP_AUDIO_OUT_HalfTransfer_CallBack();
  }
//}}}
//{{{
void HAL_SAI_RxCpltCallback (SAI_HandleTypeDef *hsai) {
  BSP_AUDIO_IN_TransferComplete_CallBack();
  }
//}}}
//{{{
void HAL_SAI_RxHalfCpltCallback (SAI_HandleTypeDef *hsai) {
  BSP_AUDIO_IN_HalfTransfer_CallBack();
  }
//}}}
//{{{
void HAL_SAI_ErrorCallback (SAI_HandleTypeDef *hsai) {

  HAL_SAI_StateTypeDef audio_out_state;
  HAL_SAI_StateTypeDef audio_in_state;

  audio_out_state = HAL_SAI_GetState(&haudio_out_sai);
  audio_in_state = HAL_SAI_GetState(&haudio_in_sai);

  // Determines if it is an audio out or audio in error
  if ((audio_out_state == HAL_SAI_STATE_BUSY) || (audio_out_state == HAL_SAI_STATE_BUSY_TX))
    BSP_AUDIO_OUT_Error_CallBack();

  if ((audio_in_state == HAL_SAI_STATE_BUSY) || (audio_in_state == HAL_SAI_STATE_BUSY_RX))
    BSP_AUDIO_IN_Error_CallBack();
  }
//}}}

// out
//{{{
uint8_t BSP_AUDIO_OUT_Init (uint16_t OutputDevice, uint8_t Volume, uint32_t AudioFreq) {

  uint8_t ret = AUDIO_ERROR;
  uint32_t deviceid = 0x00;

