colinporth/seggerF7/BSP/stm32746g_audio.c
  // Disable SAI
  SAIx_Out_DeInit();

  // PLL clock is set depending on the AudioFreq (44.1khz vs 48khz groups)
  BSP_AUDIO_OUT_ClockConfig (&haudio_out_sai, AudioFreq, NULL);

  // SAI data transfer preparation:
  // Prepare the Media to be used for the audio transfer from memory to SAI peripheral
  haudio_out_sai.Instance = AUDIO_OUT_SAIx;
  if (HAL_SAI_GetState(&haudio_out_sai) == HAL_SAI_STATE_RESET)
    // Init the SAI MSP: this __weak function can be redefined by the application
    BSP_AUDIO_OUT_MspInit(&haudio_out_sai, NULL);
  SAIx_Out_Init(AudioFreq);

  // wm8994 codec initialization
  deviceid = wm8994_drv.ReadID(AUDIO_I2C_ADDRESS);
  if ((deviceid) == WM8994_ID) {
    // Reset the Codec Registers
    wm8994_drv.Reset(AUDIO_I2C_ADDRESS);
    // Initialize the audio driver structure
    audio_drv = &wm8994_drv;
    ret = AUDIO_OK;
    }
  else
    ret = AUDIO_ERROR;

  if (ret == AUDIO_OK)
    // Initialize the codec internal registers
    audio_drv->Init(AUDIO_I2C_ADDRESS, OutputDevice, Volume, AudioFreq);

  return ret;
  }
//}}}
//{{{
void BSP_AUDIO_OUT_DeInit() {

  SAIx_Out_DeInit();
  BSP_AUDIO_OUT_MspDeInit(&haudio_out_sai, NULL);
  }
//}}}

//{{{
uint8_t BSP_AUDIO_OUT_Play (uint16_t* pBuffer, uint32_t Size) {

  audio_drv->Play (AUDIO_I2C_ADDRESS, pBuffer, Size);
  HAL_SAI_Transmit_DMA (&haudio_out_sai, (uint8_t*) pBuffer, DMA_MAX(Size / AUDIODATA_SIZE));
  return AUDIO_OK;
  }
//}}}
//{{{
void BSP_AUDIO_OUT_ChangeBuffer (uint16_t *pData, uint16_t Size) {
  HAL_SAI_Transmit_DMA (&haudio_out_sai, (uint8_t*) pData, Size);
  }
//}}}
//{{{
uint8_t BSP_AUDIO_OUT_Pause() {

  audio_drv->Pause (AUDIO_I2C_ADDRESS);
  HAL_SAI_DMAPause (&haudio_out_sai);
  return AUDIO_OK;
  }
//}}}
//{{{
uint8_t BSP_AUDIO_OUT_Resume() {

  audio_drv->Resume (AUDIO_I2C_ADDRESS);
  HAL_SAI_DMAResume (&haudio_out_sai);
  return AUDIO_OK;
  }
//}}}
//{{{
uint8_t BSP_AUDIO_OUT_Stop (uint32_t Option) {

  HAL_SAI_DMAStop (&haudio_out_sai);

  audio_drv->Stop (AUDIO_I2C_ADDRESS, Option);
  if (Option == CODEC_PDWN_HW)
    // Wait at least 100us
    HAL_Delay(1);

  return AUDIO_OK;
  }
//}}}
//{{{
uint8_t BSP_AUDIO_OUT_SetVolume (uint8_t Volume) {

  audio_drv->SetVolume(AUDIO_I2C_ADDRESS, Volume);
  return AUDIO_OK;
  }
//}}}
//{{{
uint8_t BSP_AUDIO_OUT_SetMute (uint32_t Cmd) {

  audio_drv->SetMute (AUDIO_I2C_ADDRESS, Cmd);
  return AUDIO_OK;
  }
//}}}
//{{{
uint8_t BSP_AUDIO_OUT_SetOutputMode (uint8_t Output) {

  audio_drv->SetOutputMode (AUDIO_I2C_ADDRESS, Output);
  return AUDIO_OK;
  }
//}}}
//{{{
void BSP_AUDIO_OUT_SetFrequency (uint32_t AudioFreq) {

  // PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups)
  BSP_AUDIO_OUT_ClockConfig(&haudio_out_sai, AudioFreq, NULL);

  // Disable SAI peripheral to allow access to SAI internal registers
  __HAL_SAI_DISABLE(&haudio_out_sai);

  // Update the SAI audio frequency configuration
  haudio_out_sai.Init.AudioFrequency = AudioFreq;
  HAL_SAI_Init(&haudio_out_sai);

  // Enable SAI peripheral to generate MCLK
  __HAL_SAI_ENABLE(&haudio_out_sai);
  }
//}}}
//{{{
void BSP_AUDIO_OUT_SetAudioFrameSlot (uint32_t AudioFrameSlot) {

  // Disable SAI peripheral to allow access to SAI internal registers
  __HAL_SAI_DISABLE (&haudio_out_sai);

  // Update the SAI audio frame slot configuration
  haudio_out_sai.SlotInit.SlotActive = AudioFrameSlot;
  HAL_SAI_Init (&haudio_out_sai);

  // Enable SAI peripheral to generate MCLK
  __HAL_SAI_ENABLE (&haudio_out_sai);
  }
//}}}

//{{{
__weak void BSP_AUDIO_OUT_MspInit (SAI_HandleTypeDef *hsai, void *Params) {

  static DMA_HandleTypeDef hdma_sai_tx;
  GPIO_InitTypeDef  gpio_init_structure;

  // Enable SAI clock
  AUDIO_OUT_SAIx_CLK_ENABLE();

  // Enable GPIO clock
  AUDIO_OUT_SAIx_MCLK_ENABLE();
  AUDIO_OUT_SAIx_SCK_SD_ENABLE();
  AUDIO_OUT_SAIx_FS_ENABLE();

  // CODEC_SAI pins configuration: FS, SCK, MCK and SD pins
  gpio_init_structure.Pin = AUDIO_OUT_SAIx_FS_PIN;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_HIGH;
  gpio_init_structure.Alternate = AUDIO_OUT_SAIx_FS_SD_MCLK_AF;
  HAL_GPIO_Init(AUDIO_OUT_SAIx_FS_GPIO_PORT, &gpio_init_structure);

  gpio_init_structure.Pin = AUDIO_OUT_SAIx_SCK_PIN;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_HIGH;
  gpio_init_structure.Alternate = AUDIO_OUT_SAIx_SCK_AF;
  HAL_GPIO_Init(AUDIO_OUT_SAIx_SCK_SD_GPIO_PORT, &gpio_init_structure);

  gpio_init_structure.Pin =  AUDIO_OUT_SAIx_SD_PIN;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_HIGH;
  gpio_init_structure.Alternate = AUDIO_OUT_SAIx_FS_SD_MCLK_AF;
  HAL_GPIO_Init(AUDIO_OUT_SAIx_SCK_SD_GPIO_PORT, &gpio_init_structure);

  gpio_init_structure.Pin = AUDIO_OUT_SAIx_MCLK_PIN;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_HIGH;
  gpio_init_structure.Alternate = AUDIO_OUT_SAIx_FS_SD_MCLK_AF;
  HAL_GPIO_Init(AUDIO_OUT_SAIx_MCLK_GPIO_PORT, &gpio_init_structure);

  // Enable the DMA clock */
  AUDIO_OUT_SAIx_DMAx_CLK_ENABLE();

  if (hsai->Instance == AUDIO_OUT_SAIx) {
    // Configure the hdma_saiTx handle parameters
    hdma_sai_tx.Init.Channel             = AUDIO_OUT_SAIx_DMAx_CHANNEL;
    hdma_sai_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    hdma_sai_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
    hdma_sai_tx.Init.MemInc              = DMA_MINC_ENABLE;
    hdma_sai_tx.Init.PeriphDataAlignment = AUDIO_OUT_SAIx_DMAx_PERIPH_DATA_SIZE;
    hdma_sai_tx.Init.MemDataAlignment    = AUDIO_OUT_SAIx_DMAx_MEM_DATA_SIZE;
    hdma_sai_tx.Init.Mode                = DMA_CIRCULAR;
    hdma_sai_tx.Init.Priority            = DMA_PRIORITY_HIGH;
    hdma_sai_tx.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
    hdma_sai_tx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
    hdma_sai_tx.Init.MemBurst            = DMA_MBURST_SINGLE;
    hdma_sai_tx.Init.PeriphBurst         = DMA_PBURST_SINGLE;
    hdma_sai_tx.Instance = AUDIO_OUT_SAIx_DMAx_STREAM;

